import pandas as pd
from datetime import datetime
df = pd.read_csv("C:\\Users\\user\\OneDrive\\Desktop\\Aditya\\Aditya_Arpit_Project.csv", index_col=0)
net = 0
print("==========================================================================================")
print("                                𝐀.𝐒 𝐒𝐏𝐎𝐑𝐓𝐒 𝐒𝐇𝐎𝐏                               ")
print("==========================================================================================")
while True:
    name = input("𝙋𝙡𝙚𝙖𝙨𝙚 𝙀𝙣𝙩𝙚𝙧 𝙔𝙤𝙪𝙧 𝙍𝙚𝙨𝙥𝙚𝙘𝙩𝙚𝙙 𝙉𝙖𝙢𝙚       :")
    if name.isnumeric():
        print("𝘐𝘯𝘷𝘢𝘭𝘪𝘥 𝘯𝘢𝘮𝘦! 𝘗𝘭𝘦𝘢𝘴𝘦 𝘦𝘯𝘵𝘦𝘳 𝘢𝘭𝘱𝘩𝘢𝘣𝘦𝘵𝘪𝘤 𝘤𝘩𝘢𝘳𝘢𝘤𝘵𝘦𝘳𝘴 𝘰𝘯𝘭𝘺.")
    else:
        break
while True:
    phone_number = input("𝙋𝙡𝙚𝙖𝙨𝙚 𝙀𝙣𝙩𝙚𝙧 𝙔𝙤𝙪𝙧 𝙋𝙝𝙤𝙣𝙚 𝙉𝙪𝙢𝙗𝙚𝙧        :")
    if not phone_number.isnumeric():
        print("𝘐𝘯𝘷𝘢𝘭𝘪𝘥 𝘱𝘩𝘰𝘯𝘦 𝘯𝘶𝘮𝘣𝘦𝘳! 𝘗𝘭𝘦𝘢𝘴𝘦 𝘦𝘯𝘵𝘦𝘳 𝘯𝘶𝘮𝘦𝘳𝘪𝘤 𝘤𝘩𝘢𝘳𝘢𝘤𝘵𝘦𝘳𝘴 𝘰𝘯𝘭𝘺.")
    elif len(phone_number) != 10:
        print("𝘐𝘯𝘷𝘢𝘭𝘪𝘥 𝘱𝘩𝘰𝘯𝘦 𝘯𝘶𝘮𝘣𝘦𝘳! 𝘗𝘭𝘦𝘢𝘴𝘦 𝘦𝘯𝘵𝘦𝘳 𝘢 10-𝘥𝘪𝘨𝘪𝘵 𝘷𝘢𝘭𝘪𝘥 𝘯𝘶𝘮𝘣𝘦𝘳 𝘰𝘯𝘭𝘺.")
    else:
        break
phone_number = int(phone_number)
while True:
    print()
    print("==========================================================================================")
    print("                                𝐌𝐀𝐈𝐍 𝐌𝐄𝐍𝐔                               ")
    print("==========================================================================================")
    print('''
           𝟏) 𝐕𝐢𝐞𝐰 𝐏𝐫𝐨𝐝𝐮𝐜𝐭𝐬
           𝟐) 𝐏𝐮𝐫𝐜𝐡𝐚𝐬𝐞 𝐈𝐭𝐞𝐦𝐬
           𝟑) 𝐄𝐱𝐢𝐭''')
    ch = input("𝘾𝙝𝙤𝙤𝙨𝙚 𝘼𝙣𝙮 𝙊𝙛 𝙏𝙝𝙚 𝘼𝙗𝙤𝙫𝙚 𝙊𝙥𝙩𝙞𝙤𝙣: ")
    if ch.isnumeric():
        ch=int(ch)
        if ch == 1:
            print()
            print("==========================================================================================")
            print("                                𝐏𝐑𝐎𝐃𝐔𝐂𝐓𝐒                                ")
            print("==========================================================================================")
            print()
            print(df)
        elif ch == 2:
            print()
            print("==========================================================================================")
            print("                                𝐏𝐔𝐑𝐂𝐇𝐀𝐒𝐄 𝐏𝐑𝐎𝐃𝐔𝐂𝐓𝐒                                ")
            print("==========================================================================================")
            print()
            itemls = []
            qtyls = []
            amtls = []
            prc = int(input("𝙀𝙣𝙩𝙚𝙧 𝙣𝙪𝙢𝙗𝙚𝙧 𝙤𝙛 𝙙𝙞𝙛𝙛𝙚𝙧𝙚𝙣𝙩 𝙋𝙧𝙤𝙙𝙪𝙘𝙩𝙨 𝙩𝙤 𝙥𝙪𝙧𝙘𝙝𝙖𝙨𝙚: "))
            if prc > 6:
                print("𝘛𝘩𝘦𝘳𝘦 𝘈𝘳𝘦 𝘖𝘯𝘭𝘺 6 𝘗𝘳𝘰𝘥𝘶𝘤𝘵𝘴 𝘐𝘯 𝘖𝘶𝘳 𝘐𝘯𝘷𝘦𝘯𝘵𝘰𝘳𝘺.")
                print("𝘗𝘭𝘦𝘢𝘴𝘦 𝘌𝘯𝘵𝘦𝘳 𝘝𝘢𝘭𝘪𝘥 𝘕𝘶𝘮𝘣𝘦𝘳 𝘖𝘧 𝘗𝘳𝘰𝘥𝘶𝘤𝘵𝘴 𝘠𝘰𝘶 𝘞𝘢𝘯𝘵 𝘛𝘰 𝘗𝘶𝘳𝘤𝘩𝘢𝘴𝘦.")
                print("𝘚𝘰𝘳𝘳𝘺 𝘍𝘰𝘳 𝘛𝘩𝘦 𝘓𝘰𝘸 𝘚𝘵𝘰𝘤𝘬.𝘞𝘦 𝘈𝘳𝘦 𝘞𝘰𝘳𝘬𝘪𝘯𝘨 𝘖𝘯 𝘖𝘶𝘳 𝘚𝘵𝘰𝘤𝘬.")
            elif 1<= prc <=6:
                for i in range(prc):
                    eid = input('𝙀𝙣𝙩𝙚𝙧 𝙋𝙧𝙤𝙙𝙪𝙘𝙩𝙨 𝙄𝘿: ').upper()
                    itemls.append(eid)
                    qty =int(input('𝙀𝙣𝙩𝙚𝙧 𝙦𝙪𝙖𝙣𝙩𝙞𝙩𝙮: '))
                    qtyls.append(qty)
                    amt = df.loc[eid]['Rate']
                    amtls.append(amt)
                    net += amt * qty
                bill = input('𝘿𝙤 𝙮𝙤𝙪 𝙬𝙖𝙣𝙩 𝙩𝙝𝙚 𝙗𝙞𝙡𝙡 𝙩𝙤 𝙗𝙚 𝙙𝙞𝙨𝙥𝙡𝙖𝙮𝙚𝙙? 𝘼𝙣𝙨𝙬𝙚𝙧 𝙞𝙣 𝙔/𝙉: ').lower()
                print()
                if bill == "y":
                    print("==========================================================================================")
                    print("                                   𝐁𝐈𝐋𝐋                                   ")
                    print("==========================================================================================")
                    print()
                    print("                                𝐀.𝐒 𝐒𝐏𝐎𝐑𝐓𝐒 𝐒𝐇𝐎𝐏                                ")
                    print("                         𝟼𝟺𝟽𝙵/𝙳-𝟻𝟼, 𝚂𝙴𝙲𝚃𝙾𝚁-𝙵, 𝙹𝙰𝙽𝙺𝙸𝙿𝚄𝚁𝙰𝙼                                ")
                    print("                           𝙽𝙴𝙰𝚁 𝚂𝙰𝙷𝙰𝚁𝙰 𝚂𝚃𝙰𝚃𝙴𝚂, 𝙻𝚄𝙲𝙺𝙽𝙾𝚆                                ")
                    print("                                𝙿𝙸𝙽 𝙲𝙾𝙳𝙴 - 𝟸𝟸𝟼𝟶𝟸𝟷                                ")
                    print("                             𝙿𝙷𝙾𝙽𝙴 𝙽𝚄𝙼𝙱𝙴𝚁 - 𝟾𝟾𝟼𝟿𝟹𝟸𝟼𝟻𝟽𝟾                                ")                                
                    bill_data = []
                    current_datetime = datetime.now()
                    print("")
                    print("𝘠𝘖𝘜𝘙 𝘙𝘌𝘚𝘗𝘌𝘊𝘛𝘌𝘋 𝘕𝘈𝘔𝘌 : " , name)
                    print("𝘠𝘖𝘜𝘙 𝘗𝘏𝘖𝘕𝘌 𝘕𝘜𝘔𝘉𝘌𝘙  : " , phone_number)
                    print("𝘋𝘈𝘛𝘌             : " , current_datetime.strftime("%Y-%m-%d"))
                    print("𝘛𝘐𝘔𝘌             : " , current_datetime.strftime("%H:%M:%S"))
                    print("")
                    print("======================================================================")
                    billdf = pd.DataFrame({'𝐏𝐑𝐎𝐃𝐔𝐂𝐓': itemls, '𝙌𝙐𝘼𝙉𝙏𝙄𝙏𝙔': qtyls, '𝘼𝙈𝙊𝙐𝙉𝙏': amtls})
                    print(billdf)
                    print('𝙔𝙤𝙪𝙧 𝙩𝙤𝙩𝙖𝙡 𝙬𝙤𝙪𝙡𝙙 𝙗𝙚:', net)
                    print("")
                    rating = int(input("\n𝙋𝙡𝙚𝙖𝙨𝙚 𝙧𝙖𝙩𝙚 𝙪𝙨 𝙤𝙪𝙩 𝙤𝙛 5 : "))
                    if 1 <= rating <= 5:
                        if rating >= 4:
                            print("𝒯𝒽𝒶𝓃𝓀 𝒴𝑜𝓊  𝐹𝑜𝓇  𝑅𝒶𝓉𝒾𝓃𝑔! 𝒫𝓁𝑒𝒶𝓈𝑒 𝒱𝒾𝓈𝒾𝓉 𝒰𝓈 𝒜𝑔𝒶𝒾𝓃 :)")
                        else:
                            print("𝘞𝘦'𝘳𝘦 𝘴𝘰𝘳𝘳𝘺 𝘧𝘰𝘳 𝘢𝘯𝘺 𝘪𝘯𝘤𝘰𝘯𝘷𝘦𝘯𝘪𝘦𝘯𝘤𝘦 𝘺𝘰𝘶 𝘧𝘢𝘤𝘦𝘥. 𝘗𝘭𝘦𝘢𝘴𝘦 𝘵𝘦𝘭𝘭 𝘶𝘴 𝘵𝘩𝘦 𝘳𝘦𝘢𝘴𝘰𝘯 : ")
                            feedback = input()
                            print("𝘛𝘩𝘢𝘯𝘬 𝘺𝘰𝘶 𝘧𝘰𝘳 𝘺𝘰𝘶𝘳 𝘧𝘦𝘦𝘥𝘣𝘢𝘤𝘬. 𝘞𝘦'𝘭𝘭 𝘸𝘰𝘳𝘬 𝘵𝘰 𝘪𝘮𝘱𝘳𝘰𝘷𝘦.")
                    else:
                        print("𝘐𝘯𝘷𝘢𝘭𝘪𝘥 𝘳𝘢𝘵𝘪𝘯𝘨. 𝘗𝘭𝘦𝘢𝘴𝘦 𝘦𝘯𝘵𝘦𝘳 𝘢 𝘳𝘢𝘵𝘪𝘯𝘨 𝘣𝘦𝘵𝘸𝘦𝘦𝘯 1 𝘢𝘯𝘥 5.")
                        break
            else:
                print("𝘗𝘭𝘦𝘢𝘴𝘦 𝘦𝘯𝘵𝘦𝘳 𝘢 𝘷𝘢𝘭𝘪𝘥 𝘯𝘶𝘮𝘣𝘦𝘳 𝘰𝘧 𝘪𝘵𝘦𝘮𝘴 𝘵𝘰 𝘱𝘶𝘳𝘤𝘩𝘢𝘴𝘦 (1 𝘵𝘰 6).")
                break

        elif ch == 3:
            break
        else:
            print("𝘐𝘯𝘷𝘢𝘭𝘪𝘥 𝘊𝘩𝘰𝘪𝘤𝘦! 𝘗𝘭𝘦𝘢𝘴𝘦 𝘤𝘩𝘰𝘰𝘴𝘦 𝘢 𝘷𝘢𝘭𝘪𝘥 𝘰𝘱𝘵𝘪𝘰𝘯 (1, 2, 𝘰𝘳 3).")
    else:
        print("𝘗𝘭𝘦𝘢𝘴𝘦 𝘌𝘯𝘵𝘦𝘳 𝘕𝘶𝘮𝘦𝘳𝘪𝘤 𝘊𝘩𝘢𝘳𝘢𝘤𝘵𝘦𝘳𝘴 𝘖𝘯𝘭𝘺.")
print("𝓣𝓱𝓪𝓷𝓴 𝓨𝓸𝓾 !")
