import pandas as pd
from datetime import datetime
from tabulate import tabulate

df = pd.read_csv("C:\\Users\\user\\OneDrive\\Documents\\Python programs\\AA_IP_Project\\Aditya_Arpit_Project.csv", index_col=0)


valid_product_ids = ["CB1", "CB2", "VV1", "NF1", "YB1", "CB3"]


net = 0


print("==========================================================================================")
print("                                𝐀.𝐒 𝐒𝐏𝐎𝐑𝐓𝐒 𝐒𝐇𝐎𝐏                               ")
print("==========================================================================================")

while True:
    name = input("𝙋𝙡𝙚𝙖𝙨𝙚 𝙀𝙣𝙩𝙚𝙧 𝙔𝙤𝙪𝙧 𝙍𝙚𝙨𝙥𝙚𝙘𝙩𝙚𝙙 𝙉𝙖𝙢𝙚       :")
    if name.isnumeric():
        print("𝘐𝘯𝘷𝘢𝘭𝘪𝘥 𝘯𝘢𝘮𝘦! 𝘗𝘭𝘦𝘢𝘴𝘦 𝘦𝘯𝘵𝘦𝘳 𝘢𝘭𝘱𝘩𝘢𝘣𝘦𝘵𝘪𝘤 𝘤𝘩𝘢𝘳𝘢𝘤𝘵𝘦𝘳𝘴 𝘰𝘯𝘭𝘺.")
    else:
        break


while True:
    phone_number = input("𝙋𝙡𝙚𝙖𝙨𝙚 𝙀𝙣𝙩𝙚𝙧 𝙔𝙤𝙪𝙧 𝙋𝙝𝙤𝙣𝙚 𝙉𝙪𝙢𝙗𝙚𝙧        :")
    if not phone_number.isnumeric():
        print("𝘐𝘯𝘷𝘢𝘭𝘪𝘥 𝘱𝘩𝘰𝘯𝘦 𝘯𝘶𝘮𝘣𝘦𝘳! 𝘗𝘭𝘦𝘢𝘴𝘦 𝘦𝘯𝘵𝘦𝘳 𝘯𝘶𝘮𝘣𝘦𝘳𝘪𝘤 𝘤𝘩𝘢𝘳𝘢𝘤𝘵𝘦𝘳𝘴 𝘰𝘯𝘭𝘺.")
    elif len(phone_number) != 10:
        print("𝘐𝘯𝘷𝘢𝘭𝘪𝘥 𝘱𝘩𝘰𝘯𝘦 𝘯𝘶𝘮𝘣𝘦𝘳! 𝘗𝘭𝘦𝘢𝘴𝘦 𝘦𝘯𝘵𝘦𝘳 𝘢 10-𝘥𝘪𝘨𝘪𝘵 𝘷𝘢𝘭𝘪𝘥 𝘯𝘶𝘮𝘣𝘦𝘳 𝘰𝘯𝘭𝘺.")
    else:
        break

phone_number = int(phone_number)


while True:
    print()
    print("==========================================================================================")
    print("                                𝐌𝐀𝐈𝐍 𝐌𝐄𝐍𝐔                               ")
    print("==========================================================================================")
    print('''
           𝟏) 𝐕𝐢𝐞𝐰 𝐏𝐫𝐨𝐝𝐮𝐜𝐭𝐬
           𝟐) 𝐏𝐮𝐫𝐜𝐡𝐚𝐬𝐞 𝐈𝐭𝐞𝐦𝐬
           𝟑) 𝐄𝐱𝐢𝐭''')
    ch = input("𝘾𝙝𝙤𝙤𝙨𝙚 𝘼𝙣𝙮 𝙊𝙛 𝙏𝙝𝙚 𝘼𝙗𝙤𝙫𝙚 𝙊𝙥𝙩𝙞𝙤𝙣: ")
    if ch.isnumeric():
        ch = int(ch)
        if ch == 1:
            print()
            print("==========================================================================================")
            print("                                𝐏𝐑𝐎𝐃𝐔𝐂𝐓𝐒                                ")
            print("==========================================================================================")
            print()
            print(df)
        elif ch == 2:
            print()
            print("==========================================================================================")
            print("                                𝐏𝐔𝐑𝐂𝐇𝐀𝐒𝐄 𝐏𝐑𝐎𝐃𝐔𝐂𝐓𝐒                                ")
            print("==========================================================================================")
            print()
            itemls = []
            qtyls = []
            amtls = []
            prc = int(input("𝙀𝙣𝙩𝙚𝙧 𝙣𝙪𝙢𝙗𝙚𝙧 𝙤𝙛 𝙙𝙞𝙛𝙛𝙚𝙧𝙚𝙣𝙩 𝙋𝙧𝙤𝙙𝙪𝙘𝙩𝙨 𝙩𝙤 𝙥𝙪𝙧𝙘𝙝𝙖𝙨𝙚: "))
        
            
            if prc > 6:
                print("𝘛𝘩𝘦𝘳𝘦 𝘈𝘳𝘦 𝘖𝘯𝘭𝘺 6 𝘗𝘳𝘰𝘥𝘶𝘤𝘵𝘴 𝘐𝘯 𝘖𝘶𝘳 𝘐𝘯𝘷𝘦𝘯𝘵𝘰𝘳𝘺.")
                print("𝘗𝘭𝘦𝘢𝘴𝘦 𝘌𝘯𝘵𝘦𝘳 𝘝𝘢𝘭𝘪𝘥 𝘕𝘶𝘮𝘣𝘦𝘳 𝘖𝘧 𝘗𝘳𝘰𝘥𝘶𝘤𝘵𝘴 𝘠𝘰𝘶 𝘞𝘢𝘯𝘵 𝘛𝘰 𝘗𝘶𝘳𝘤𝘩𝘢𝘴𝘦.")
                print("𝘚𝘰𝘳𝘳𝘺 𝘍𝘰𝘳 𝘛𝘩𝘦 𝘓𝘰𝘸 𝘚𝘵𝘰𝘤𝘬. 𝘞𝘦 𝘈𝘳𝘦 𝘞𝘰𝘳𝘬𝘪𝘯𝘨 𝘖𝘯 𝘖𝘶𝘳 𝘚𝘵𝘰𝘤𝘬.")
            elif 1 <= prc <= 6:
                print("𝘍𝘰𝘭𝘭𝘰𝘸𝘪𝘯𝘨 𝘪𝘴 𝘛𝘩𝘦 𝘓𝘪𝘴𝘵 𝘖𝘧 𝘛𝘩𝘦 𝘗𝘳𝘰𝘥𝘶𝘤𝘵𝘴 𝘈𝘷𝘢𝘪𝘭𝘢𝘣𝘭𝘦 𝘐𝘯 𝘖𝘶𝘳 𝘐𝘯𝘷𝘦𝘯𝘵𝘰𝘳𝘺.")
                print("𝘠𝘰𝘶 𝘊𝘢𝘯 𝘗𝘶𝘳𝘤𝘩𝘢𝘴𝘦 𝘛𝘩𝘦 𝘗𝘳𝘰𝘥𝘶𝘤𝘵𝘴 𝘉𝘺 𝘌𝘯𝘵𝘦𝘳𝘪𝘯𝘨 𝘛𝘩𝘦 𝘗𝘳𝘰𝘥𝘶𝘤𝘵_𝘐𝘋 𝘈𝘯𝘥 𝘛𝘩𝘦 𝘘𝘶𝘢𝘯𝘵𝘪𝘵𝘺")
                print()
                print(df)
                print()
                for i in range(prc):
                    while True:
                        eid = input('𝙀𝙣𝙩𝙚𝙧 𝙋𝙧𝙤𝙙𝙪𝙘𝙩𝙨 𝙄𝘿: ').upper()
                        if eid in valid_product_ids:
                            break
                        else:
                            print("Invalid product ID. Please enter a valid product ID.")

                    itemls.append(eid)
                    qty = int(input('𝙀𝙣𝙩𝙚𝙧 𝙦𝙪𝙖𝙣𝙩𝙞𝙩𝙮: '))
                    qtyls.append(qty)
                    amt = df.loc[eid]['Rate']
                    amtls.append(amt)
                    net += amt * qty

                bill = input('𝘿𝙤 𝙮𝙤𝙪 𝙬𝙖𝙣𝙩 𝙩𝙝𝙚 𝙗𝙞𝙡𝙡 𝙩𝙤 𝙗𝙚 𝙙𝙞𝙨𝙥𝙡𝙖𝙮𝙚𝙙? 𝘼𝙣𝙨𝙬𝙚𝙧 𝙞𝙣 𝙔/𝙉: ').lower()
                print()
                if bill == "y":
                    print("==========================================================================================")
                    print("                                   𝐁𝐈𝐋𝐋                                   ")
                    print("==========================================================================================")
                    print()
                    print("                                𝐀.𝐒 𝐒𝐏𝐎𝐑𝐓𝐒 𝐒𝐇𝐎𝐏                                ")
                    print("                         𝟼𝟺𝟽𝙵/𝙳-𝟻𝟼, 𝚂𝙴𝙲𝚃𝙾𝚁-𝙵, 𝙹𝙰𝙽𝙺𝙸𝙿𝚄𝚁𝙰𝙼                                ")
                    print("                           𝙽𝙴𝙰𝚁 𝚂𝙰𝙷𝙰𝚁𝙰 𝚂𝚃𝙰𝚃𝙴𝚂, 𝙻𝚄𝙲𝙺𝙽𝙾𝚆                                ")
                    print("                                𝙿𝙸𝙽 𝙲𝙾𝙳𝙴 - 𝟸𝟸𝟼𝟶𝟸𝟷                                ")
                    print("                             𝙿𝙷𝙾𝙽𝙴 𝙽𝚄𝙼𝙱𝙴𝚁 - 𝟾𝟾𝟼𝟿𝟹𝟸𝟼𝟻𝟽𝟾                                ")                                
                    bill_data = []
                    current_datetime = datetime.now()
                    print("")
                    print("𝘠𝘖𝘜𝘙 𝘙𝘌𝘚𝘗𝘌𝘊𝘛𝘌𝘋 𝘕𝘈𝘔𝘌 : " , name)
                    print("𝘠𝘖𝘜𝘙 𝘗𝘏𝘖𝘕𝘌 𝘕𝘜𝘔𝘉𝘌𝘙  : " , phone_number)
                    print("𝘋𝘈𝘛𝘌             : " , current_datetime.strftime("%Y-%m-%d"))
                    print("𝘛𝘐𝘔𝘌             : " , current_datetime.strftime("%H:%M:%S"))
                    print("")
                    print("======================================================================")
                    billdf = pd.DataFrame(tabulate({'𝐏𝐑𝐎𝐃𝐔𝐂𝐓': itemls, '𝙌𝙐𝘼𝙉𝙏𝙄𝙏𝙔': qtyls, '𝘼𝙈𝙊𝙐𝙉𝙏': amtls}))
                    print(billdf)
                    print('𝙔𝙤𝙪𝙧 𝙩𝙤𝙩𝙖𝙡 𝙬𝙤𝙪𝙡𝙙 𝙗𝙚:', net)
                    print("")
                    def main():
                        rating = float(input("\n𝙋𝙡𝙚𝙖𝙨𝙚 𝙧𝙖𝙩𝙚 𝙪𝙨 𝙤𝙪𝙩 𝙤𝙛 5 : "))
                        if rating >= 4.5:
                            print("𝒯𝒽𝒶𝓃𝓀 𝓎𝑜𝓊 𝒻𝑜𝓇 𝓎𝑜𝓊𝓇 𝑒𝓍𝒸𝑒𝓁𝓁𝑒𝓃𝓉 𝓇𝒶𝓉𝒾𝓃𝑔! 𝒲𝑒'𝓇𝑒 𝑔𝓁𝒶𝒹 𝓎𝑜𝓊 𝒽𝒶𝒹 𝒶 𝑔𝓇𝑒𝒶𝓉 𝑒𝓍𝓅𝑒𝓇𝒾𝑒𝓃𝒸𝑒.")
                        elif rating >= 3.5:
                            print("𝘛𝘩𝘢𝘯𝘬 𝘺𝘰𝘶 𝘧𝘰𝘳 𝘺𝘰𝘶𝘳 𝘱𝘰𝘴𝘪𝘵𝘪𝘷𝘦 𝘳𝘢𝘵𝘪𝘯𝘨! 𝘞𝘦 𝘢𝘱𝘱𝘳𝘦𝘤𝘪𝘢𝘵𝘦 𝘺𝘰𝘶𝘳 𝘧𝘦𝘦𝘥𝘣𝘢𝘤𝘬.")
                        elif rating >= 2.5:
                            print("𝘛𝘩𝘢𝘯𝘬 𝘺𝘰𝘶 𝘧𝘰𝘳 𝘺𝘰𝘶𝘳 𝘧𝘦𝘦𝘥𝘣𝘢𝘤𝘬. 𝘞𝘦 𝘸𝘪𝘭𝘭 𝘸𝘰𝘳𝘬 𝘵𝘰 𝘪𝘮𝘱𝘳𝘰𝘷𝘦 𝘺𝘰𝘶𝘳 𝘦𝘹𝘱𝘦𝘳𝘪𝘦𝘯𝘤𝘦.")
                        elif rating >= 1.5:
                            print("𝘞𝘦'𝘳𝘦 𝘴𝘰𝘳𝘳𝘺 𝘵𝘰 𝘩𝘦𝘢𝘳 𝘢𝘣𝘰𝘶𝘵 𝘺𝘰𝘶𝘳 𝘦𝘹𝘱𝘦𝘳𝘪𝘦𝘯𝘤𝘦. 𝘗𝘭𝘦𝘢𝘴𝘦 𝘭𝘦𝘵 𝘶𝘴 𝘬𝘯𝘰𝘸 𝘩𝘰𝘸 𝘸𝘦 𝘤𝘢𝘯 𝘪𝘮𝘱𝘳𝘰𝘷𝘦 :")
                            feedback = input()
                            print("𝘛𝘩𝘢𝘯𝘬 𝘺𝘰𝘶 𝘧𝘰𝘳 𝘺𝘰𝘶𝘳 𝘧𝘦𝘦𝘥𝘣𝘢𝘤𝘬. 𝘞𝘦'𝘭𝘭 𝘸𝘰𝘳𝘬 𝘵𝘰 𝘪𝘮𝘱𝘳𝘰𝘷𝘦 𝘺𝘰𝘶𝘳 𝘦𝘹𝘱𝘦𝘳𝘪𝘦𝘯𝘤𝘦.")
                        else:
                            print("𝘞𝘦 𝘢𝘱𝘰𝘭𝘰𝘨𝘪𝘻𝘦 𝘧𝘰𝘳 𝘺𝘰𝘶𝘳 𝘶𝘯𝘴𝘢𝘵𝘪𝘴𝘧𝘢𝘤𝘵𝘰𝘳𝘺 𝘦𝘹𝘱𝘦𝘳𝘪𝘦𝘯𝘤𝘦. 𝘗𝘭𝘦𝘢𝘴𝘦 𝘳𝘦𝘢𝘤𝘩 𝘰𝘶𝘵 𝘵𝘰 𝘶𝘴 𝘧𝘰𝘳 𝘢𝘴𝘴𝘪𝘴𝘵𝘢𝘯𝘤𝘦.")

                    if __name__ == "__main__":
                        main()
                        break
            else:
                print("𝘗𝘭𝘦𝘢𝘴𝘦 𝘦𝘯𝘵𝘦𝘳 𝘢 𝘷𝘢𝘭𝘪𝘥 𝘯𝘶𝘮𝘣𝘦𝘳 𝘰𝘧 𝘪𝘵𝘦𝘮𝘴 𝘵𝘰 𝘱𝘶𝘳𝘤𝘩𝘢𝘴𝘦 (1 𝘵𝘰 6).")
                break

        elif ch == 3:
            break
        else:
            print("𝘐𝘯𝘷𝘢𝘭𝘪𝘥 𝘊𝘩𝘰𝘪𝘤𝘦! 𝘗𝘭𝘦𝘢𝘴𝘦 𝘤𝘩𝘰𝘰𝘴𝘦 𝘢 𝘷𝘢𝘭𝘪𝘥 𝘰𝘱𝘵𝘪𝘰𝘯 (1, 2, 𝘰𝘳 3).")
    else:
        print("𝘗𝘭𝘦𝘢𝘴𝘦 𝘌𝘯𝘵𝘦𝘳 𝘕𝘶𝘮𝘦𝘳𝘪𝘤 𝘊𝘩𝘢𝘳𝘢𝘤𝘵𝘦𝘳𝘴 𝘖𝘯𝘭𝘺.")
print("𝓣𝓱𝓪𝓷𝓴 𝓨𝓸𝓾 !")

